import React, { createContext, useContext, useState } from 'react';
import { CarIcon } from '../Components/Icons/CarIcon/CarIcon';
import { CommercialCarIcon } from '../Components/Icons/CommercialCarIcon/CommercialCarIcon';
import { OtherTransportIcon } from '../Components/Icons/OtherTransportIcon/OtherTransportIcon';


const AddCarDataContext = createContext();

export function AddCarDataProvider({ children }) {
  const [addCarData] = useState({
    selectCarType: [
      {
        type: 'Легкові автомобілі',
        icon: <CarIcon color="var( --bs-darkgray )" width={26} height={26} />,
        bodies: [
          'Седан',
          'Хетчбэк 4/5 дверей',
          'Хетчбек 2/3 двері',
          'Купе',
          'Кабріолет/Родстер',
          'Універсал',
          'Мінівен',
          'Позашляховик',
          'Позашляховик-пікап'
        ]
      },
      {
        type: 'Комерційні авто',
        icon: <CommercialCarIcon color="var( --bs-darkgray )" width={26} height={26} />,
        bodies: [
          'Фургон пасажир',
          'Фургон вантаж-пас.',
          'Фургон/пікап вантажний',
          'Фургон REF',
          'Мікробус пасажир',
          'Мікробус вантаж-пас.',
          'Мікробус вантажний',
          'Мікробус REF',
          'Автобус',
          'Шасі',
          'Шасі REF',
          'Самоскид',
          'Тягач',
          'Спецтехніка'
        ]
      },
      {
        type: 'Мото, Авіа, Водний транспорт',
        icon: <OtherTransportIcon color="var( --bs-darkgray )" width={26} height={26} />,
        bodies: ['Причіп', 'МОТО-транспорт', 'Авіа-транспорт', 'Водний-транспорт']
      }
    ], // типи машин, кузова
    selectYear: Array.from(
      { length: new Date().getFullYear() - 1920 + 1 },
      (_, i) => new Date().getFullYear() - i
    ), // роки
    selectEngineType: ['Бензин', 'Дизель', 'Газ', 'Гідроген', 'Гібрид', 'Електро'], // паливо
    selectOccasion: ['Передній', 'Задній', 'Повний'], // привід
    selectTransmissionType: ['Механіка', 'Автомат'], // коробка передач
    selectState: [
      'Не вимагає вкладень',
      'Потребує ремонту',
      'Після ДТП (з документами)',
      'Запчастини та комплектуючі',
      'Нове авто - 0 пробіг'
    ], // коробка передач
    selectRegionsAndCities: [
      {
        region: 'Вінницька обл.',
        cities: [
          'Вінниця',
          'Жмеринка',
          'Могилів-Подільський',
          'Хмільник',
          'Гайсин',
          'Бар'
        ]
      },
      {
        region: 'Волинська обл.',
        cities: [
          'Луцьк',
          'Ковель',
          'Нововолинськ',
          'Володимир',
          'Рожище',
          'Ківерці'
        ]
      },
      {
        region: 'Дніпропетровська обл.',
        cities: [
          'Дніпро',
          'Кривий Ріг',
          'Павлоград',
          'Кам\'янське',
          'Нікополь',
          'Новомосковськ'
        ]
      },
      {
        region: 'Донецька обл.',
        cities: [
          'Донецьк',
          'Маріуполь',
          'Макіївка',
          'Слов\'янськ',
          'Краматорськ',
          'Горлівка'
        ]
      },
      {
        region: 'Житомирська обл.',
        cities: [
          'Житомир',
          'Бердичів',
          'Коростень',
          'Малин',
          'Новоград-Волинський',
          'Овруч'
        ]
      },
      {
        region: 'Закарпатська обл.',
        cities: [
          'Ужгород',
          'Мукачево',
          'Хуст',
          'Берегово',
          'Свалява',
          'Тячів'
        ]
      },
      {
        region: 'Запорізька обл.',
        cities: [
          'Запоріжжя',
          'Мелітополь',
          'Бердянськ',
          'Енергодар',
          'Токмак',
          'Василівка'
        ]
      },
      {
        region: 'Івано-Франківська обл.',
        cities: [
          'Івано-Франківськ',
          'Коломия',
          'Калуш',
          'Яремче',
          'Болехів',
          'Галич'
        ]
      },
      {
        region: 'Київська обл.',
        cities: [
          'Київ',
          'Біла Церква',
          'Бориспіль',
          'Бровари',
          'Фастів',
          'Ірпінь'
        ]
      },
      {
        region: 'Кіровоградська обл.',
        cities: [
          'Кропивницький',
          'Олександрія',
          'Світловодськ',
          'Знам\'янка',
          'Гайворон',
          'Долинська'
        ]
      },
      {
        region: 'Луганська обл.',
        cities: [
          'Луганськ',
          'Сєвєродонецьк',
          'Лисичанськ',
          'Алчевськ',
          'Красний Луч',
          'Старобільськ'
        ]
      },
      {
        region: 'Львівська обл.',
        cities: [
          'Львів',
          'Дрогобич',
          'Червоноград',
          'Стрий',
          'Трускавець',
          'Самбір'
        ]
      },
      {
        region: 'Миколаївська обл.',
        cities: [
          'Миколаїв',
          'Вознесенськ',
          'Первомайськ',
          'Южноукраїнськ',
          'Очаків',
          'Новий Буг'
        ]
      },
      {
        region: 'Одеська обл.',
        cities: [
          'Одеса',
          'Ізмаїл',
          'Чорноморськ',
          'Южне',
          'Білгород-Дністровський',
          'Подільськ'
        ]
      },
      {
        region: 'Полтавська обл.',
        cities: [
          'Полтава',
          'Кременчук',
          'Лубни',
          'Миргород',
          'Горішні Плавні',
          'Карлівка'
        ]
      },
      {
        region: 'Рівненська обл.',
        cities: [
          'Рівне',
          'Дубно',
          'Вараш',
          'Острог',
          'Сарни',
          'Здолбунів'
        ]
      },
      {
        region: 'Сумська обл.',
        cities: [
          'Суми',
          'Конотоп',
          'Шостка',
          'Охтирка',
          'Ромни',
          'Глухів'
        ]
      },
      {
        region: 'Тернопільська обл.',
        cities: [
          'Тернопіль',
          'Чортків',
          'Кременець',
          'Бережани',
          'Збараж',
          'Теребовля'
        ]
      },
      {
        region: 'Харківська обл.',
        cities: [
          'Харків',
          'Куп\'янськ',
          'Лозова',
          'Ізюм',
          'Чугуїв',
          'Первомайський'
        ]
      },
      {
        region: 'Херсонська обл.',
        cities: [
          'Херсон',
          'Нова Каховка',
          'Каховка',
          'Генічеськ',
          'Скадовськ',
          'Олешки'
        ]
      },
      {
        region: 'Хмельницька обл.',
        cities: [
          'Хмельницький',
          'Кам\'янець-Подільський',
          'Шепетівка',
          'Старокостянтинів',
          'Нетішин',
          'Славута'
        ]
      },
      {
        region: 'Черкаська обл.',
        cities: [
          'Черкаси',
          'Умань',
          'Сміла',
          'Канів',
          'Золотоноша',
          'Шпола'
        ]
      },
      {
        region: 'Чернівецька обл.',
        cities: [
          'Чернівці',
          'Новодністровськ',
          'Сторожинець',
          'Хотин',
          'Кіцмань',
          'Заставна'
        ]
      },
      {
        region: 'Чернігівська обл.',
        cities: [
          'Чернігів',
          'Ніжин',
          'Прилуки',
          'Бахмач',
          'Новгород-Сіверський',
          'Городня'
        ]
      }
    ], // міста, регіони
  });

  return <AddCarDataContext.Provider value={addCarData}>{children}</AddCarDataContext.Provider>;
}

export function useAddCarData() {
  return useContext(AddCarDataContext);
}
